quimblos/firmware-esp32/sdkconfig.defaults
#
# Serial flasher config
#
# default:
# CONFIG_ESPTOOLPY_NO_STUB is not set
# default:
# CONFIG_ESPTOOLPY_FLASHMODE_QIO is not set
# default:
# CONFIG_ESPTOOLPY_FLASHMODE_QOUT is not set
# default:
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
# default:
# CONFIG_ESPTOOLPY_FLASHMODE_DOUT is not set
# default:
CONFIG_ESPTOOLPY_FLASH_SAMPLE_MODE_STR=y
# default:
CONFIG_ESPTOOLPY_FLASHMODE="dio"
# default:
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
# default:
# CONFIG_ESPTOOLPY_FLASHFREQ_40M is not set
# default:
# CONFIG_ESPTOOLPY_FLASHFREQ_26M is not set
# default:
# CONFIG_ESPTOOLPY_FLASHFREQ_20M is not set
# default:
CONFIG_ESPTOOLPY_FLASHFREQ="80m"
# default:
# CONFIG_ESPTOOLPY_FLASHSIZE_1MB is not set
# default:
CONFIG_ESPTOOLPY_FLASHSIZE_2MB=y
# default:
# CONFIG_ESPTOOLPY_FLASHSIZE_4MB is not set
# default:
# CONFIG_ESPTOOLPY_FLASHSIZE_8MB is not set
# default:
# CONFIG_ESPTOOLPY_FLASHSIZE_16MB is not set
# default:
# CONFIG_ESPTOOLPY_FLASHSIZE_32MB is not set
# default:
# CONFIG_ESPTOOLPY_FLASHSIZE_64MB is not set
# default:
# CONFIG_ESPTOOLPY_FLASHSIZE_128MB is not set
# default:
CONFIG_ESPTOOLPY_FLASHSIZE="2MB"
# default:
# CONFIG_ESPTOOLPY_HEADER_FLASHSIZE_UPDATE is not set
# default:
CONFIG_ESPTOOLPY_BEFORE_RESET=y
# default:
# CONFIG_ESPTOOLPY_BEFORE_NORESET is not set
# default:
CONFIG_ESPTOOLPY_BEFORE="default-reset"
# default:
CONFIG_ESPTOOLPY_AFTER_RESET=y
# default:
# CONFIG_ESPTOOLPY_AFTER_NORESET is not set
# default:
CONFIG_ESPTOOLPY_AFTER="hard-reset"
# default:
CONFIG_ESPTOOLPY_MONITOR_BAUD=115200
# end of Serial flasher config

#
# Partition Table
#
# CONFIG_PARTITION_TABLE_SINGLE_APP is not set
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y
# CONFIG_PARTITION_TABLE_TWO_OTA is not set
# CONFIG_PARTITION_TABLE_TWO_OTA_LARGE is not set
# CONFIG_PARTITION_TABLE_CUSTOM is not set
# default:
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
# default:
CONFIG_PARTITION_TABLE_FILENAME="partitions_singleapp_large.csv"
# default:
CONFIG_PARTITION_TABLE_OFFSET=0x8000
# default:
CONFIG_PARTITION_TABLE_MD5=y
# end of Partition Table

#
# Quimblos
#
# default:
CONFIG_QUIMBLOS_WIFI_CONNECTION_MAXIMUM_RETRY=10
# default:
# CONFIG_ESP_WIFI_AUTH_OPEN is not set
# default:
# CONFIG_ESP_WIFI_AUTH_WEP is not set
# default:
# CONFIG_ESP_WIFI_AUTH_WPA_PSK is not set
# default:
CONFIG_ESP_WIFI_AUTH_WPA2_PSK=y
# default:
# CONFIG_ESP_WIFI_AUTH_WPA_WPA2_PSK is not set
# default:
# CONFIG_ESP_WIFI_AUTH_WPA3_PSK is not set
# default:
# CONFIG_ESP_WIFI_AUTH_WPA2_WPA3_PSK is not set
# default:
# CONFIG_ESP_WIFI_AUTH_WAPI_PSK is not set
# default:
# CONFIG_QUIMBLOS_BLUFI_BLE_SMP_ENABLE is not set
# end of Quimblos

#
# Compiler options
#
# CONFIG_COMPILER_OPTIMIZATION_DEBUG is not set
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
# CONFIG_COMPILER_OPTIMIZATION_PERF is not set
# CONFIG_COMPILER_OPTIMIZATION_NONE is not set
# default:
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_ENABLE=y
# default:
# CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_SILENT is not set
# default:
# CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_DISABLE is not set
# default:
# CONFIG_COMPILER_ASSERT_NDEBUG_EVALUATE is not set
# default:
CONFIG_COMPILER_FLOAT_LIB_FROM_GCCLIB=y
# default:
CONFIG_COMPILER_OPTIMIZATION_ASSERTION_LEVEL=2
# default:
# CONFIG_COMPILER_OPTIMIZATION_CHECKS_SILENT is not set
# default:
CONFIG_COMPILER_HIDE_PATHS_MACROS=y
# default:
# CONFIG_COMPILER_CXX_EXCEPTIONS is not set
# default:
# CONFIG_COMPILER_CXX_RTTI is not set
# default:
CONFIG_COMPILER_STACK_CHECK_MODE_NONE=y
# default:
# CONFIG_COMPILER_STACK_CHECK_MODE_NORM is not set
# default:
# CONFIG_COMPILER_STACK_CHECK_MODE_STRONG is not set
# default:
# CONFIG_COMPILER_STACK_CHECK_MODE_ALL is not set
# default:
# CONFIG_COMPILER_NO_MERGE_CONSTANTS is not set
# default:
# CONFIG_COMPILER_WARN_WRITE_STRINGS is not set
# default:
# CONFIG_COMPILER_SAVE_RESTORE_LIBCALLS is not set
# default:
# CONFIG_COMPILER_DISABLE_DEFAULT_ERRORS is not set
# default:
# CONFIG_COMPILER_DISABLE_GCC12_WARNINGS is not set
# default:
# CONFIG_COMPILER_DISABLE_GCC13_WARNINGS is not set
# default:
# CONFIG_COMPILER_DISABLE_GCC14_WARNINGS is not set
# default:
# CONFIG_COMPILER_DISABLE_GCC15_WARNINGS is not set
# default:
# CONFIG_COMPILER_DUMP_RTL_FILES is not set
# default:
CONFIG_COMPILER_RT_LIB_GCCLIB=y
# default:
CONFIG_COMPILER_RT_LIB_NAME="gcc"
# default:
CONFIG_COMPILER_ORPHAN_SECTIONS_ERROR=y
# default:
# CONFIG_COMPILER_ORPHAN_SECTIONS_WARNING is not set
# default:
# CONFIG_COMPILER_ORPHAN_SECTIONS_PLACE is not set
# default:
# CONFIG_COMPILER_STATIC_ANALYZER is not set
# default:
CONFIG_COMPILER_CXX_GLIBCXX_CONSTEXPR_NO_CHANGE=y
# default:
# CONFIG_COMPILER_CXX_GLIBCXX_CONSTEXPR_COLD_CONSTEXPR is not set
# default:
# CONFIG_COMPILER_CXX_GLIBCXX_CONSTEXPR_COLD is not set
# end of Compiler options

#
# Component config
#

#
# !!! MINIMAL_BUILD is enabled !!!
#

#
# Only common components and those transitively required by the main component are listed
#

#
# If a component configuration is missing, please add it to the main component's requirements
#

#
# Bluetooth
#
CONFIG_BT_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=y
# CONFIG_BT_NIMBLE_ENABLED is not set
# CONFIG_BT_CONTROLLER_ONLY is not set
# default:
CONFIG_BT_CONTROLLER_ENABLED=y
# default:
# CONFIG_BT_CONTROLLER_DISABLED is not set

#
# Common Options
#
# default:
CONFIG_BT_ALARM_MAX_NUM=50

#
# BT Logs
#

#
# Log Sources
#
# end of Log Sources

# default:
# CONFIG_BT_LOG_CRITICAL_ONLY is not set
# default:
# CONFIG_BLE_LOG_ENABLED is not set

#
# Legacy SPI Log Output (Deprecated - use BT Log Async Output instead)
#
# default:
# CONFIG_BT_BLE_LOG_SPI_OUT_ENABLED is not set
# end of Legacy SPI Log Output (Deprecated - use BT Log Async Output instead)
# end of BT Logs

# default:
# CONFIG_BT_LE_USED_MEM_STATISTICS_ENABLED is not set
# end of Common Options

#
# Bluedroid Options
#
# default:
CONFIG_BT_BTC_TASK_STACK_SIZE=3072
# default:
CONFIG_BT_BLUEDROID_PINNED_TO_CORE=0
# default:
CONFIG_BT_BTU_TASK_STACK_SIZE=4352
# default:
CONFIG_BT_BLUEDROID_ESP_COEX_VSC=y
# default:
CONFIG_BT_BLE_ENABLED=y
# default:
CONFIG_BT_GATTS_ENABLE=y
# default:
# CONFIG_BT_GATTS_PPCP_CHAR_GAP is not set
CONFIG_BT_BLE_BLUFI_ENABLE=y
# default:
CONFIG_BT_GATT_MAX_SR_PROFILES=8
# default:
CONFIG_BT_GATT_MAX_SR_ATTRIBUTES=100
# default:
# CONFIG_BT_GATTS_SEND_SERVICE_CHANGE_MANUAL is not set
# default:
CONFIG_BT_GATTS_SEND_SERVICE_CHANGE_AUTO=y
# default:
CONFIG_BT_GATTS_SEND_SERVICE_CHANGE_MODE=0
# default:
# CONFIG_BT_GATTS_ROBUST_CACHING_ENABLED is not set
# default:
# CONFIG_BT_GATTS_DEVICE_NAME_WRITABLE is not set
# default:
# CONFIG_BT_GATTS_APPEARANCE_WRITABLE is not set
# default:
# CONFIG_BT_GATTS_SECURITY_LEVELS_CHAR is not set
# default:
# CONFIG_BT_GATTS_KEY_MATERIAL_CHAR is not set
# CONFIG_BT_GATTC_ENABLE is not set
# CONFIG_BT_BLE_SMP_ENABLE is not set

#
# Bluedroid debug option
#
# default:
# CONFIG_BT_BLUEDROID_MEM_DEBUG is not set
# default:
# CONFIG_BT_BLUEDROID_MEM_STATS is not set
# default:
# CONFIG_BT_BLUEDROID_THREAD_DEBUG is not set
# end of Bluedroid debug option

# default:
# CONFIG_BT_STACK_NO_LOG is not set

#
# BT DEBUG LOG LEVEL
#
# default:
# CONFIG_BT_LOG_HCI_TRACE_LEVEL_NONE is not set
# default:
# CONFIG_BT_LOG_HCI_TRACE_LEVEL_ERROR is not set
# default:
CONFIG_BT_LOG_HCI_TRACE_LEVEL_WARNING=y
# default:
# CONFIG_BT_LOG_HCI_TRACE_LEVEL_API is not set
# default:
# CONFIG_BT_LOG_HCI_TRACE_LEVEL_EVENT is not set
# default:
# CONFIG_BT_LOG_HCI_TRACE_LEVEL_DEBUG is not set
# default:
# CONFIG_BT_LOG_HCI_TRACE_LEVEL_VERBOSE is not set
# default:
CONFIG_BT_LOG_HCI_TRACE_LEVEL=2
# default:
# CONFIG_BT_LOG_BTM_TRACE_LEVEL_NONE is not set
# default:
# CONFIG_BT_LOG_BTM_TRACE_LEVEL_ERROR is not set
# default:
CONFIG_BT_LOG_BTM_TRACE_LEVEL_WARNING=y
# default:
# CONFIG_BT_LOG_BTM_TRACE_LEVEL_API is not set
# default:
# CONFIG_BT_LOG_BTM_TRACE_LEVEL_EVENT is not set
# default:
# CONFIG_BT_LOG_BTM_TRACE_LEVEL_DEBUG is not set
# default:
# CONFIG_BT_LOG_BTM_TRACE_LEVEL_VERBOSE is not set
# default:
CONFIG_BT_LOG_BTM_TRACE_LEVEL=2
# default:
# CONFIG_BT_LOG_L2CAP_TRACE_LEVEL_NONE is not set
# default:
# CONFIG_BT_LOG_L2CAP_TRACE_LEVEL_ERROR is not set
# default:
CONFIG_BT_LOG_L2CAP_TRACE_LEVEL_WARNING=y
# default:
# CONFIG_BT_LOG_L2CAP_TRACE_LEVEL_API is not set
# default:
# CONFIG_BT_LOG_L2CAP_TRACE_LEVEL_EVENT is not set
# default:
# CONFIG_BT_LOG_L2CAP_TRACE_LEVEL_DEBUG is not set
# default:
# CONFIG_BT_LOG_L2CAP_TRACE_LEVEL_VERBOSE is not set
# default:
CONFIG_BT_LOG_L2CAP_TRACE_LEVEL=2
# default:
# CONFIG_BT_LOG_RFCOMM_TRACE_LEVEL_NONE is not set
# default:
# CONFIG_BT_LOG_RFCOMM_TRACE_LEVEL_ERROR is not set
# default:
CONFIG_BT_LOG_RFCOMM_TRACE_LEVEL_WARNING=y
# default:
# CONFIG_BT_LOG_RFCOMM_TRACE_LEVEL_API is not set
# default:
# CONFIG_BT_LOG_RFCOMM_TRACE_LEVEL_EVENT is not set
# default:
# CONFIG_BT_LOG_RFCOMM_TRACE_LEVEL_DEBUG is not set
# default:
# CONFIG_BT_LOG_RFCOMM_TRACE_LEVEL_VERBOSE is not set
# default:
CONFIG_BT_LOG_RFCOMM_TRACE_LEVEL=2
# default:
# CONFIG_BT_LOG_SDP_TRACE_LEVEL_NONE is not set
# default:
# CONFIG_BT_LOG_SDP_TRACE_LEVEL_ERROR is not set
# default:
CONFIG_BT_LOG_SDP_TRACE_LEVEL_WARNING=y
# default:
# CONFIG_BT_LOG_SDP_TRACE_LEVEL_API is not set
# default:
# CONFIG_BT_LOG_SDP_TRACE_LEVEL_EVENT is not set
# default:
# CONFIG_BT_LOG_SDP_TRACE_LEVEL_DEBUG is not set
# default:
# CONFIG_BT_LOG_SDP_TRACE_LEVEL_VERBOSE is not set
# default:
CONFIG_BT_LOG_SDP_TRACE_LEVEL=2
# default:
# CONFIG_BT_LOG_GAP_TRACE_LEVEL_NONE is not set
# default:
# CONFIG_BT_LOG_GAP_TRACE_LEVEL_ERROR is not set
# default:
CONFIG_BT_LOG_GAP_TRACE_LEVEL_WARNING=y
# default:
# CONFIG_BT_LOG_GAP_TRACE_LEVEL_API is not set
# default:
# CONFIG_BT_LOG_GAP_TRACE_LEVEL_EVENT is not set
# default:
# CONFIG_BT_LOG_GAP_TRACE_LEVEL_DEBUG is not set
# default:
# CONFIG_BT_LOG_GAP_TRACE_LEVEL_VERBOSE is not set
# default:
CONFIG_BT_LOG_GAP_TRACE_LEVEL=2
# default:
# CONFIG_BT_LOG_BNEP_TRACE_LEVEL_NONE is not set
# default:
# CONFIG_BT_LOG_BNEP_TRACE_LEVEL_ERROR is not set
# default:
CONFIG_BT_LOG_BNEP_TRACE_LEVEL_WARNING=y
# default:
# CONFIG_BT_LOG_BNEP_TRACE_LEVEL_API is not set
# default:
# CONFIG_BT_LOG_BNEP_TRACE_LEVEL_EVENT is not set
# default:
# CONFIG_BT_LOG_BNEP_TRACE_LEVEL_DEBUG is not set
# default:
# CONFIG_BT_LOG_BNEP_TRACE_LEVEL_VERBOSE is not set
# default:
CONFIG_BT_LOG_BNEP_TRACE_LEVEL=2
# default:
# CONFIG_BT_LOG_PAN_TRACE_LEVEL_NONE is not set
# default:
# CONFIG_BT_LOG_PAN_TRACE_LEVEL_ERROR is not set
# default:
CONFIG_BT_LOG_PAN_TRACE_LEVEL_WARNING=y
# default:
# CONFIG_BT_LOG_PAN_TRACE_LEVEL_API is not set
# default:
# CONFIG_BT_LOG_PAN_TRACE_LEVEL_EVENT is not set
# default:
# CONFIG_BT_LOG_PAN_TRACE_LEVEL_DEBUG is not set
# default:
# CONFIG_BT_LOG_PAN_TRACE_LEVEL_VERBOSE is not set
# default:
CONFIG_BT_LOG_PAN_TRACE_LEVEL=2
# default:
# CONFIG_BT_LOG_A2D_TRACE_LEVEL_NONE is not set
# default:
# CONFIG_BT_LOG_A2D_TRACE_LEVEL_ERROR is not set
# default:
CONFIG_BT_LOG_A2D_TRACE_LEVEL_WARNING=y
# default:
# CONFIG_BT_LOG_A2D_TRACE_LEVEL_API is not set
# default:
# CONFIG_BT_LOG_A2D_TRACE_LEVEL_EVENT is not set
# default:
# CONFIG_BT_LOG_A2D_TRACE_LEVEL_DEBUG is not set
# default:
# CONFIG_BT_LOG_A2D_TRACE_LEVEL_VERBOSE is not set
# default:
CONFIG_BT_LOG_A2D_TRACE_LEVEL=2
# default:
# CONFIG_BT_LOG_AVDT_TRACE_LEVEL_NONE is not set
# default:
# CONFIG_BT_LOG_AVDT_TRACE_LEVEL_ERROR is not set
# default:
CONFIG_BT_LOG_AVDT_TRACE_LEVEL_WARNING=y
# default:
# CONFIG_BT_LOG_AVDT_TRACE_LEVEL_API is not set
# default:
# CONFIG_BT_LOG_AVDT_TRACE_LEVEL_EVENT is not set
# default:
# CONFIG_BT_LOG_AVDT_TRACE_LEVEL_DEBUG is not set
# default:
# CONFIG_BT_LOG_AVDT_TRACE_LEVEL_VERBOSE is not set
# default:
CONFIG_BT_LOG_AVDT_TRACE_LEVEL=2
# default:
# CONFIG_BT_LOG_AVCT_TRACE_LEVEL_NONE is not set
# default:
# CONFIG_BT_LOG_AVCT_TRACE_LEVEL_ERROR is not set
# default:
CONFIG_BT_LOG_AVCT_TRACE_LEVEL_WARNING=y
# default:
# CONFIG_BT_LOG_AVCT_TRACE_LEVEL_API is not set
# default:
# CONFIG_BT_LOG_AVCT_TRACE_LEVEL_EVENT is not set
# default:
# CONFIG_BT_LOG_AVCT_TRACE_LEVEL_DEBUG is not set
# default:
# CONFIG_BT_LOG_AVCT_TRACE_LEVEL_VERBOSE is not set
# default:
CONFIG_BT_LOG_AVCT_TRACE_LEVEL=2
# default:
# CONFIG_BT_LOG_AVRC_TRACE_LEVEL_NONE is not set
# default:
# CONFIG_BT_LOG_AVRC_TRACE_LEVEL_ERROR is not set
# default:
CONFIG_BT_LOG_AVRC_TRACE_LEVEL_WARNING=y
# default:
# CONFIG_BT_LOG_AVRC_TRACE_LEVEL_API is not set
# default:
# CONFIG_BT_LOG_AVRC_TRACE_LEVEL_EVENT is not set
# default:
# CONFIG_BT_LOG_AVRC_TRACE_LEVEL_DEBUG is not set
# default:
# CONFIG_BT_LOG_AVRC_TRACE_LEVEL_VERBOSE is not set
# default:
CONFIG_BT_LOG_AVRC_TRACE_LEVEL=2
# default:
# CONFIG_BT_LOG_MCA_TRACE_LEVEL_NONE is not set
# default:
# CONFIG_BT_LOG_MCA_TRACE_LEVEL_ERROR is not set
# default:
CONFIG_BT_LOG_MCA_TRACE_LEVEL_WARNING=y
# default:
# CONFIG_BT_LOG_MCA_TRACE_LEVEL_API is not set
# default:
# CONFIG_BT_LOG_MCA_TRACE_LEVEL_EVENT is not set
# default:
# CONFIG_BT_LOG_MCA_TRACE_LEVEL_DEBUG is not set
# default:
# CONFIG_BT_LOG_MCA_TRACE_LEVEL_VERBOSE is not set
# default:
CONFIG_BT_LOG_MCA_TRACE_LEVEL=2
# default:
# CONFIG_BT_LOG_HID_TRACE_LEVEL_NONE is not set
# default:
# CONFIG_BT_LOG_HID_TRACE_LEVEL_ERROR is not set
# default:
CONFIG_BT_LOG_HID_TRACE_LEVEL_WARNING=y
# default:
# CONFIG_BT_LOG_HID_TRACE_LEVEL_API is not set
# default:
# CONFIG_BT_LOG_HID_TRACE_LEVEL_EVENT is not set
# default:
# CONFIG_BT_LOG_HID_TRACE_LEVEL_DEBUG is not set
# default:
# CONFIG_BT_LOG_HID_TRACE_LEVEL_VERBOSE is not set
# default:
CONFIG_BT_LOG_HID_TRACE_LEVEL=2
# default:
# CONFIG_BT_LOG_APPL_TRACE_LEVEL_NONE is not set
# default:
# CONFIG_BT_LOG_APPL_TRACE_LEVEL_ERROR is not set
# default:
CONFIG_BT_LOG_APPL_TRACE_LEVEL_WARNING=y
# default:
# CONFIG_BT_LOG_APPL_TRACE_LEVEL_API is not set
# default:
# CONFIG_BT_LOG_APPL_TRACE_LEVEL_EVENT is not set
# default:
# CONFIG_BT_LOG_APPL_TRACE_LEVEL_DEBUG is not set
# default:
# CONFIG_BT_LOG_APPL_TRACE_LEVEL_VERBOSE is not set
# default:
CONFIG_BT_LOG_APPL_TRACE_LEVEL=2
# default:
# CONFIG_BT_LOG_GATT_TRACE_LEVEL_NONE is not set
# default:
# CONFIG_BT_LOG_GATT_TRACE_LEVEL_ERROR is not set
# default:
CONFIG_BT_LOG_GATT_TRACE_LEVEL_WARNING=y
# default:
# CONFIG_BT_LOG_GATT_TRACE_LEVEL_API is not set
# default:
# CONFIG_BT_LOG_GATT_TRACE_LEVEL_EVENT is not set
# default:
# CONFIG_BT_LOG_GATT_TRACE_LEVEL_DEBUG is not set
# default:
# CONFIG_BT_LOG_GATT_TRACE_LEVEL_VERBOSE is not set
# default:
CONFIG_BT_LOG_GATT_TRACE_LEVEL=2
# default:
# CONFIG_BT_LOG_SMP_TRACE_LEVEL_NONE is not set
# default:
# CONFIG_BT_LOG_SMP_TRACE_LEVEL_ERROR is not set
# default:
CONFIG_BT_LOG_SMP_TRACE_LEVEL_WARNING=y
# default:
# CONFIG_BT_LOG_SMP_TRACE_LEVEL_API is not set
# default:
# CONFIG_BT_LOG_SMP_TRACE_LEVEL_EVENT is not set
# default:
# CONFIG_BT_LOG_SMP_TRACE_LEVEL_DEBUG is not set
# default:
# CONFIG_BT_LOG_SMP_TRACE_LEVEL_VERBOSE is not set
# default:
CONFIG_BT_LOG_SMP_TRACE_LEVEL=2
# default:
# CONFIG_BT_LOG_BTIF_TRACE_LEVEL_NONE is not set
# default:
# CONFIG_BT_LOG_BTIF_TRACE_LEVEL_ERROR is not set
# default:
CONFIG_BT_LOG_BTIF_TRACE_LEVEL_WARNING=y
# default:
# CONFIG_BT_LOG_BTIF_TRACE_LEVEL_API is not set
# default:
# CONFIG_BT_LOG_BTIF_TRACE_LEVEL_EVENT is not set
# default:
# CONFIG_BT_LOG_BTIF_TRACE_LEVEL_DEBUG is not set
# default:
# CONFIG_BT_LOG_BTIF_TRACE_LEVEL_VERBOSE is not set
# default:
CONFIG_BT_LOG_BTIF_TRACE_LEVEL=2
# default:
# CONFIG_BT_LOG_BTC_TRACE_LEVEL_NONE is not set
# default:
# CONFIG_BT_LOG_BTC_TRACE_LEVEL_ERROR is not set
# default:
CONFIG_BT_LOG_BTC_TRACE_LEVEL_WARNING=y
# default:
# CONFIG_BT_LOG_BTC_TRACE_LEVEL_API is not set
# default:
# CONFIG_BT_LOG_BTC_TRACE_LEVEL_EVENT is not set
# default:
# CONFIG_BT_LOG_BTC_TRACE_LEVEL_DEBUG is not set
# default:
# CONFIG_BT_LOG_BTC_TRACE_LEVEL_VERBOSE is not set
# default:
CONFIG_BT_LOG_BTC_TRACE_LEVEL=2
# default:
# CONFIG_BT_LOG_OSI_TRACE_LEVEL_NONE is not set
# default:
# CONFIG_BT_LOG_OSI_TRACE_LEVEL_ERROR is not set
# default:
CONFIG_BT_LOG_OSI_TRACE_LEVEL_WARNING=y
# default:
# CONFIG_BT_LOG_OSI_TRACE_LEVEL_API is not set
# default:
# CONFIG_BT_LOG_OSI_TRACE_LEVEL_EVENT is not set
# default:
# CONFIG_BT_LOG_OSI_TRACE_LEVEL_DEBUG is not set
# default:
# CONFIG_BT_LOG_OSI_TRACE_LEVEL_VERBOSE is not set
# default:
CONFIG_BT_LOG_OSI_TRACE_LEVEL=2
# default:
# CONFIG_BT_LOG_BLUFI_TRACE_LEVEL_NONE is not set
# default:
# CONFIG_BT_LOG_BLUFI_TRACE_LEVEL_ERROR is not set
# default:
CONFIG_BT_LOG_BLUFI_TRACE_LEVEL_WARNING=y
# default:
# CONFIG_BT_LOG_BLUFI_TRACE_LEVEL_API is not set
# default:
# CONFIG_BT_LOG_BLUFI_TRACE_LEVEL_EVENT is not set
# default:
# CONFIG_BT_LOG_BLUFI_TRACE_LEVEL_DEBUG is not set
# default:
# CONFIG_BT_LOG_BLUFI_TRACE_LEVEL_VERBOSE is not set
# default:
CONFIG_BT_LOG_BLUFI_TRACE_LEVEL=2
# end of BT DEBUG LOG LEVEL

# default:
CONFIG_BT_ACL_CONNECTIONS=4
# default:
CONFIG_BT_MULTI_CONNECTION_ENBALE=y
# default:
# CONFIG_BT_ALLOCATION_FROM_SPIRAM_FIRST is not set
# default:
# CONFIG_BT_BLE_DYNAMIC_ENV_MEMORY is not set
# default:
# CONFIG_BT_BLE_ACT_SCAN_REP_ADV_SCAN is not set
# default:
CONFIG_BT_MAX_DEVICE_NAME_LEN=32
# default:
CONFIG_BT_BLE_RPA_TIMEOUT=900
# default:
CONFIG_BT_BLE_HOST_ALLOW_SUB_SPEC_MIN_CONN_INT=y
# CONFIG_BT_BLE_50_FEATURES_SUPPORTED is not set
CONFIG_BT_BLE_42_FEATURES_SUPPORTED=y
# CONFIG_BT_BLE_42_DTM_TEST_EN is not set
# default:
CONFIG_BT_BLE_42_ADV_EN=y
# CONFIG_BT_BLE_42_SCAN_EN is not set
# default:
CONFIG_BT_BLE_VENDOR_HCI_EN=y
# default:
# CONFIG_BT_BLE_HIGH_DUTY_ADV_INTERVAL is not set
# default:
# CONFIG_BT_ABORT_WHEN_ALLOCATION_FAILS is not set
# end of Bluedroid Options

