quimblos/firmware-esp32/sdkconfig.defaults
#
# Controller Options
#
# default:
CONFIG_BT_CTRL_MODE_EFF=1
# default:
CONFIG_BT_CTRL_BLE_MAX_ACT=6
# default:
CONFIG_BT_CTRL_BLE_MAX_ACT_EFF=6
# default:
CONFIG_BT_CTRL_BLE_STATIC_ACL_TX_BUF_NB=0
# default:
CONFIG_BT_CTRL_PINNED_TO_CORE=0
# default:
CONFIG_BT_CTRL_HCI_MODE_VHCI=y
# default:
# CONFIG_BT_CTRL_HCI_MODE_UART_H4 is not set
# default:
CONFIG_BT_CTRL_HCI_TL=1
# default:
CONFIG_BT_CTRL_ADV_DUP_FILT_MAX=30
# default:
CONFIG_BT_BLE_CCA_MODE_NONE=y
# default:
# CONFIG_BT_BLE_CCA_MODE_HW is not set
# default:
# CONFIG_BT_BLE_CCA_MODE_SW is not set
# default:
CONFIG_BT_BLE_CCA_MODE=0
# default:
CONFIG_BT_CTRL_HW_CCA_VAL=75
# default:
CONFIG_BT_CTRL_HW_CCA_EFF=0
# default:
CONFIG_BT_CTRL_CE_LENGTH_TYPE_ORIG=y
# default:
# CONFIG_BT_CTRL_CE_LENGTH_TYPE_CE is not set
# default:
# CONFIG_BT_CTRL_CE_LENGTH_TYPE_SD is not set
# default:
CONFIG_BT_CTRL_CE_LENGTH_TYPE_EFF=0
# default:
CONFIG_BT_CTRL_TX_ANTENNA_INDEX_0=y
# default:
# CONFIG_BT_CTRL_TX_ANTENNA_INDEX_1 is not set
# default:
CONFIG_BT_CTRL_TX_ANTENNA_INDEX_EFF=0
# default:
CONFIG_BT_CTRL_RX_ANTENNA_INDEX_0=y
# default:
# CONFIG_BT_CTRL_RX_ANTENNA_INDEX_1 is not set
# default:
CONFIG_BT_CTRL_RX_ANTENNA_INDEX_EFF=0
# default:
# CONFIG_BT_CTRL_DFT_TX_POWER_LEVEL_N24 is not set
# default:
# CONFIG_BT_CTRL_DFT_TX_POWER_LEVEL_N21 is not set
# default:
# CONFIG_BT_CTRL_DFT_TX_POWER_LEVEL_N18 is not set
# default:
# CONFIG_BT_CTRL_DFT_TX_POWER_LEVEL_N15 is not set
# default:
# CONFIG_BT_CTRL_DFT_TX_POWER_LEVEL_N12 is not set
# default:
# CONFIG_BT_CTRL_DFT_TX_POWER_LEVEL_N9 is not set
# default:
# CONFIG_BT_CTRL_DFT_TX_POWER_LEVEL_N6 is not set
# default:
# CONFIG_BT_CTRL_DFT_TX_POWER_LEVEL_N3 is not set
# default:
# CONFIG_BT_CTRL_DFT_TX_POWER_LEVEL_N0 is not set
# default:
# CONFIG_BT_CTRL_DFT_TX_POWER_LEVEL_P3 is not set
# default:
# CONFIG_BT_CTRL_DFT_TX_POWER_LEVEL_P6 is not set
# default:
CONFIG_BT_CTRL_DFT_TX_POWER_LEVEL_P9=y
# default:
# CONFIG_BT_CTRL_DFT_TX_POWER_LEVEL_P12 is not set
# default:
# CONFIG_BT_CTRL_DFT_TX_POWER_LEVEL_P15 is not set
# default:
# CONFIG_BT_CTRL_DFT_TX_POWER_LEVEL_P18 is not set
# default:
# CONFIG_BT_CTRL_DFT_TX_POWER_LEVEL_P20 is not set
# default:
CONFIG_BT_CTRL_DFT_TX_POWER_LEVEL_EFF=11
# default:
CONFIG_BT_CTRL_BLE_ADV_REPORT_FLOW_CTRL_SUPP=y
# default:
CONFIG_BT_CTRL_BLE_ADV_REPORT_FLOW_CTRL_NUM=100
# default:
CONFIG_BT_CTRL_BLE_ADV_REPORT_DISCARD_THRSHOLD=20
# default:
CONFIG_BT_CTRL_BLE_SCAN_DUPL=y
# default:
CONFIG_BT_CTRL_SCAN_DUPL_TYPE_DEVICE=y
# default:
# CONFIG_BT_CTRL_SCAN_DUPL_TYPE_DATA is not set
# default:
# CONFIG_BT_CTRL_SCAN_DUPL_TYPE_DATA_DEVICE is not set
# default:
CONFIG_BT_CTRL_SCAN_DUPL_TYPE=0
# default:
CONFIG_BT_CTRL_SCAN_DUPL_CACHE_SIZE=100
# default:
CONFIG_BT_CTRL_DUPL_SCAN_CACHE_REFRESH_PERIOD=0
# default:
# CONFIG_BT_CTRL_BLE_MESH_SCAN_DUPL_EN is not set
# default:
# CONFIG_BT_CTRL_COEX_PHY_CODED_TX_RX_TLIM_EN is not set
# default:
CONFIG_BT_CTRL_COEX_PHY_CODED_TX_RX_TLIM_DIS=y
# default:
CONFIG_BT_CTRL_COEX_PHY_CODED_TX_RX_TLIM_EFF=0

#
# MODEM SLEEP Options
#
# default:
# CONFIG_BT_CTRL_MODEM_SLEEP is not set
# end of MODEM SLEEP Options

# default:
CONFIG_BT_CTRL_SLEEP_MODE_EFF=0
# default:
CONFIG_BT_CTRL_SLEEP_CLOCK_EFF=0
# default:
CONFIG_BT_CTRL_HCI_TL_EFF=1
# default:
# CONFIG_BT_CTRL_AGC_RECORRECT_EN is not set
# default:
# CONFIG_BT_CTRL_SCAN_BACKOFF_UPPERLIMITMAX is not set
# default:
# CONFIG_BT_BLE_ADV_DATA_LENGTH_ZERO_AUX is not set
# default:
CONFIG_BT_CTRL_CHAN_ASS_EN=y
# default:
CONFIG_BT_CTRL_LE_PING_EN=y

#
# BLE disconnects when Instant Passed (0x28) occurs
#
# default:
# CONFIG_BT_CTRL_BLE_LLCP_CONN_UPDATE is not set
# default:
# CONFIG_BT_CTRL_BLE_LLCP_CHAN_MAP_UPDATE is not set
# default:
# CONFIG_BT_CTRL_BLE_LLCP_PHY_UPDATE is not set
# end of BLE disconnects when Instant Passed (0x28) occurs

# default:
# CONFIG_BT_CTRL_RUN_IN_FLASH_ONLY is not set
# default:
CONFIG_BT_CTRL_DTM_ENABLE=y
# default:
CONFIG_BT_CTRL_BLE_MASTER=y
# default:
# CONFIG_BT_CTRL_BLE_TEST is not set
# default:
CONFIG_BT_CTRL_BLE_SCAN=y
# default:
CONFIG_BT_CTRL_BLE_SECURITY_ENABLE=y
# default:
CONFIG_BT_CTRL_BLE_ADV=y
# default:
# CONFIG_BT_CTRL_CHECK_CONNECT_IND_ACCESS_ADDRESS is not set
# default:
CONFIG_BT_CTRL_BLE_MIN_CONN_INTERVAL_ENABLE=y

#
# Controller debug log Options (Experimental)
#
# default:
# CONFIG_BT_CTRL_LE_LOG_EN is not set
# end of Controller debug log Options (Experimental)
# end of Controller Options

# default:
# CONFIG_BT_HCI_LOG_DEBUG_EN is not set
# end of Bluetooth

# default:
# CONFIG_BLE_MESH is not set

#
# eFuse Bit Manager
#
# default:
# CONFIG_EFUSE_CUSTOM_TABLE is not set
# default:
# CONFIG_EFUSE_VIRTUAL is not set
# default:
CONFIG_EFUSE_MAX_BLK_LEN=256
# end of eFuse Bit Manager

#
# ESP-TLS
#
# default:
CONFIG_ESP_TLS_USING_MBEDTLS=y
# default:
# CONFIG_ESP_TLS_CUSTOM_STACK is not set
# default:
# CONFIG_ESP_TLS_USE_SECURE_ELEMENT is not set
# default:
CONFIG_ESP_TLS_USE_DS_PERIPHERAL=y
# default:
# CONFIG_ESP_TLS_CLIENT_SESSION_TICKETS is not set
# default:
# CONFIG_ESP_TLS_SERVER_SESSION_TICKETS is not set
# default:
# CONFIG_ESP_TLS_SERVER_CERT_SELECT_HOOK is not set
# default:
# CONFIG_ESP_TLS_SERVER_MIN_AUTH_MODE_OPTIONAL is not set
# default:
# CONFIG_ESP_TLS_PSK_VERIFICATION is not set
# default:
# CONFIG_ESP_TLS_INSECURE is not set
# default:
CONFIG_ESP_TLS_DYN_BUF_STRATEGY_SUPPORTED=y
# end of ESP-TLS

#
# Wireless Coexistence
#
# default:
CONFIG_ESP_COEX_ENABLED=y
# default:
CONFIG_ESP_COEX_SW_COEXIST_ENABLE=y
# default:
# CONFIG_ESP_COEX_POWER_MANAGEMENT is not set
# default:
# CONFIG_ESP_COEX_GPIO_DEBUG is not set
# end of Wireless Coexistence

#
# Common ESP-related
#
# default:
CONFIG_ESP_ERR_TO_NAME_LOOKUP=y
# end of Common ESP-related

#
# GDMA Configurations
#
# default:
CONFIG_GDMA_CTRL_FUNC_IN_IRAM=y
# default:
CONFIG_GDMA_ISR_HANDLER_IN_IRAM=y
# default:
CONFIG_GDMA_OBJ_DRAM_SAFE=y
# default:
# CONFIG_GDMA_ENABLE_DEBUG_LOG is not set
# end of GDMA Configurations

#
# ESP-Driver:GPIO Configurations
#
# default:
# CONFIG_GPIO_CTRL_FUNC_IN_IRAM is not set
# end of ESP-Driver:GPIO Configurations

#
# ESP-Driver:RMT Configurations
#
# default:
CONFIG_RMT_ENCODER_FUNC_IN_IRAM=y
# default:
CONFIG_RMT_TX_ISR_HANDLER_IN_IRAM=y
# default:
CONFIG_RMT_RX_ISR_HANDLER_IN_IRAM=y
# default:
# CONFIG_RMT_RECV_FUNC_IN_IRAM is not set
# default:
# CONFIG_RMT_TX_ISR_CACHE_SAFE is not set
# default:
# CONFIG_RMT_RX_ISR_CACHE_SAFE is not set
# default:
CONFIG_RMT_OBJ_CACHE_SAFE=y
# default:
# CONFIG_RMT_ENABLE_DEBUG_LOG is not set
# default:
# CONFIG_RMT_ISR_IRAM_SAFE is not set
# end of ESP-Driver:RMT Configurations

#
# ESP-Driver:SPI Configurations
#
# default:
CONFIG_SPI_MASTER_ISR_IN_IRAM=y
# default:
# CONFIG_SPI_SLAVE_IN_IRAM is not set
# default:
CONFIG_SPI_SLAVE_ISR_IN_IRAM=y
# end of ESP-Driver:SPI Configurations

#
# ESP-Driver:UART Configurations
#
# default:
# CONFIG_UART_ISR_IN_IRAM is not set
# end of ESP-Driver:UART Configurations

#
# ESP-Driver:UHCI Configurations
#
# default:
# CONFIG_UHCI_ISR_HANDLER_IN_IRAM is not set
# default:
# CONFIG_UHCI_ISR_CACHE_SAFE is not set
# default:
# CONFIG_UHCI_ENABLE_DEBUG_LOG is not set
# end of ESP-Driver:UHCI Configurations

#
# ESP-Driver:USB Serial/JTAG Configuration
#
# default:
CONFIG_USJ_ENABLE_USB_SERIAL_JTAG=y
# end of ESP-Driver:USB Serial/JTAG Configuration

#
# Event Loop Library
#
# default:
# CONFIG_ESP_EVENT_LOOP_PROFILING is not set
# default:
CONFIG_ESP_EVENT_POST_FROM_ISR=y
# default:
CONFIG_ESP_EVENT_POST_FROM_IRAM_ISR=y
# end of Event Loop Library

#
# GDB Stub
#
# default:
CONFIG_ESP_GDBSTUB_ENABLED=y
# default:
# CONFIG_ESP_SYSTEM_GDBSTUB_RUNTIME is not set
# default:
CONFIG_ESP_GDBSTUB_SUPPORT_TASKS=y
# default:
CONFIG_ESP_GDBSTUB_MAX_TASKS=32
# end of GDB Stub

#
# HTTP Server
#
# default:
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
# default:
CONFIG_HTTPD_MAX_URI_LEN=512
# default:
CONFIG_HTTPD_ERR_RESP_NO_DELAY=y
# default:
CONFIG_HTTPD_PURGE_BUF_LEN=32
# default:
# CONFIG_HTTPD_LOG_PURGE_DATA is not set
CONFIG_HTTPD_WS_SUPPORT=y
# default:
# CONFIG_HTTPD_QUEUE_WORK_BLOCKING is not set
# default:
CONFIG_HTTPD_SERVER_EVENT_POST_TIMEOUT=2000
# default:
# CONFIG_HTTPD_WS_PRE_HANDSHAKE_CB_SUPPORT is not set
# default:
# CONFIG_HTTPD_WS_POST_HANDSHAKE_CB_SUPPORT is not set
# end of HTTP Server

#
# ESP HTTPS server
#
CONFIG_ESP_HTTPS_SERVER_ENABLE=y
# default:
CONFIG_ESP_HTTPS_SERVER_EVENT_POST_TIMEOUT=2000
# default:
# CONFIG_ESP_HTTPS_SERVER_CERT_SELECT_HOOK is not set
# end of ESP HTTPS server

#
# Hardware Settings
#
# default:
CONFIG_ESP_HW_SUPPORT_FUNC_IN_IRAM=y

#
# Chip revision
#
# default:
# CONFIG_ESP32C3_REV_MIN_0 is not set
# default:
# CONFIG_ESP32C3_REV_MIN_1 is not set
# default:
# CONFIG_ESP32C3_REV_MIN_2 is not set
# default:
CONFIG_ESP32C3_REV_MIN_3=y
# default:
# CONFIG_ESP32C3_REV_MIN_4 is not set
# default:
# CONFIG_ESP32C3_REV_MIN_101 is not set
# default:
CONFIG_ESP32C3_REV_MIN_FULL=3
# default:
CONFIG_ESP_REV_MIN_FULL=3

#
# Maximum Supported ESP32-C3 Revision (Rev v1.99)
#
# default:
CONFIG_ESP32C3_REV_MAX_FULL=199
# default:
CONFIG_ESP_REV_MAX_FULL=199
# default:
CONFIG_ESP_EFUSE_BLOCK_REV_MIN_FULL=0
# default:
CONFIG_ESP_EFUSE_BLOCK_REV_MAX_FULL=199

#
# Maximum Supported ESP32-C3 eFuse Block Revision (eFuse Block Rev v1.99)
#
# end of Chip revision

#
# MAC Config
#
# default:
CONFIG_ESP_MAC_ADDR_UNIVERSE_WIFI_STA=y
# default:
CONFIG_ESP_MAC_ADDR_UNIVERSE_WIFI_AP=y
# default:
CONFIG_ESP_MAC_ADDR_UNIVERSE_BT=y
# default:
CONFIG_ESP_MAC_ADDR_UNIVERSE_ETH=y
# default:
CONFIG_ESP_MAC_UNIVERSAL_MAC_ADDRESSES_FOUR=y
# default:
CONFIG_ESP_MAC_UNIVERSAL_MAC_ADDRESSES=4
# default:
# CONFIG_ESP32C3_UNIVERSAL_MAC_ADDRESSES_TWO is not set
# default:
CONFIG_ESP32C3_UNIVERSAL_MAC_ADDRESSES_FOUR=y
# default:
CONFIG_ESP32C3_UNIVERSAL_MAC_ADDRESSES=4
# default:
# CONFIG_ESP_MAC_USE_CUSTOM_MAC_AS_BASE_MAC is not set
# end of MAC Config

#
# Sleep Config
#
# default:
# CONFIG_ESP_SLEEP_POWER_DOWN_FLASH is not set
# default:
CONFIG_ESP_SLEEP_FLASH_LEAKAGE_WORKAROUND=y
# default:
# CONFIG_ESP_SLEEP_MSPI_NEED_ALL_IO_PU is not set
# default:
CONFIG_ESP_SLEEP_GPIO_RESET_WORKAROUND=y
# default:
CONFIG_ESP_SLEEP_WAIT_FLASH_READY_EXTRA_DELAY=0
# default:
# CONFIG_ESP_SLEEP_CACHE_SAFE_ASSERTION is not set
# default:
# CONFIG_ESP_SLEEP_DEBUG is not set
# default:
CONFIG_ESP_SLEEP_GPIO_ENABLE_INTERNAL_RESISTORS=y
# end of Sleep Config

#
# RTC Clock Config
#
# default:
CONFIG_RTC_CLK_SRC_INT_RC=y
# default:
# CONFIG_RTC_CLK_SRC_EXT_CRYS is not set
# default:
# CONFIG_RTC_CLK_SRC_EXT_OSC is not set
# default:
# CONFIG_RTC_CLK_SRC_INT_8MD256 is not set
# default:
CONFIG_RTC_CLK_CAL_CYCLES=1024
# default:
CONFIG_RTC_CLK_FUNC_IN_IRAM=y
# default:
CONFIG_RTC_TIME_FUNC_IN_IRAM=y
# end of RTC Clock Config

#
# Peripheral Control
#
# default:
CONFIG_ESP_PERIPH_CTRL_FUNC_IN_IRAM=y
# default:
CONFIG_ESP_REGI2C_CTRL_FUNC_IN_IRAM=y
# end of Peripheral Control

#
# Main XTAL Config
#
# default:
CONFIG_XTAL_FREQ_40=y
# default:
CONFIG_XTAL_FREQ=40
# end of Main XTAL Config

#
# Power Supplier
#

#
# Brownout Detector
#
# default:
CONFIG_ESP_BROWNOUT_DET=y
# default:
CONFIG_ESP_BROWNOUT_DET_LVL_SEL_7=y
# default:
# CONFIG_ESP_BROWNOUT_DET_LVL_SEL_6 is not set
# default:
# CONFIG_ESP_BROWNOUT_DET_LVL_SEL_5 is not set
# default:
# CONFIG_ESP_BROWNOUT_DET_LVL_SEL_4 is not set
# default:
# CONFIG_ESP_BROWNOUT_DET_LVL_SEL_3 is not set
# default:
# CONFIG_ESP_BROWNOUT_DET_LVL_SEL_2 is not set
# default:
CONFIG_ESP_BROWNOUT_DET_LVL=7
# default:
CONFIG_ESP_BROWNOUT_USE_INTR=y
# end of Brownout Detector
# end of Power Supplier

# default:
CONFIG_ESP_SPI_BUS_LOCK_ISR_FUNCS_IN_IRAM=y
# default:
CONFIG_ESP_INTR_IN_IRAM=y
# end of Hardware Settings

#
# LibC
#
# default:
# CONFIG_LIBC_NEWLIB is not set
# default:
CONFIG_LIBC_PICOLIBC=y
# default:
CONFIG_LIBC_PICOLIBC_NEWLIB_COMPATIBILITY=y
# default:
CONFIG_LIBC_MISC_IN_IRAM=y
# default:
CONFIG_LIBC_LOCKS_PLACE_IN_IRAM=y
# default:
CONFIG_LIBC_STDOUT_LINE_ENDING_CRLF=y
# default:
# CONFIG_LIBC_STDOUT_LINE_ENDING_LF is not set
# default:
# CONFIG_LIBC_STDOUT_LINE_ENDING_CR is not set
# default:
# CONFIG_LIBC_STDIN_LINE_ENDING_CRLF is not set
# default:
# CONFIG_LIBC_STDIN_LINE_ENDING_LF is not set
# default:
CONFIG_LIBC_STDIN_LINE_ENDING_CR=y
# default:
CONFIG_LIBC_TIME_SYSCALL_USE_RTC_HRT=y
# default:
# CONFIG_LIBC_TIME_SYSCALL_USE_RTC is not set
# default:
# CONFIG_LIBC_TIME_SYSCALL_USE_HRT is not set
# default:
# CONFIG_LIBC_TIME_SYSCALL_USE_NONE is not set
# default:
CONFIG_LIBC_OPTIMIZED_MISALIGNED_ACCESS=y
# default:
CONFIG_LIBC_ASSERT_BUFFER_SIZE=200
# end of LibC

#
# ESP-MM: Memory Management Configurations
#
# end of ESP-MM: Memory Management Configurations

#
# ESP NETIF Adapter
#
# default:
CONFIG_ESP_NETIF_LOST_IP_TIMER_ENABLE=y
# default:
CONFIG_ESP_NETIF_IP_LOST_TIMER_INTERVAL=120
# default:
# CONFIG_ESP_NETIF_PROVIDE_CUSTOM_IMPLEMENTATION is not set
# default:
CONFIG_ESP_NETIF_TCPIP_LWIP=y
# default:
# CONFIG_ESP_NETIF_LOOPBACK is not set
# default:
CONFIG_ESP_NETIF_USES_TCPIP_WITH_BSD_API=y
# default:
CONFIG_ESP_NETIF_REPORT_DATA_TRAFFIC=y
# default:
CONFIG_ESP_NETIF_RECEIVE_REPORT_ERRORS=y
# default:
# CONFIG_ESP_NETIF_L2_TAP is not set
# default:
# CONFIG_ESP_NETIF_BRIDGE_EN is not set
# default:
# CONFIG_ESP_NETIF_SET_DNS_PER_DEFAULT_NETIF is not set
# end of ESP NETIF Adapter

#
# Partition API Configuration
#
# end of Partition API Configuration

#
# PHY
#
# default:
CONFIG_ESP_PHY_ENABLED=y
# default:
CONFIG_ESP_PHY_CALIBRATION_AND_DATA_STORAGE=y
# default:
# CONFIG_ESP_PHY_INIT_DATA_IN_PARTITION is not set
# default:
CONFIG_ESP_PHY_MAX_WIFI_TX_POWER=20
# default:
CONFIG_ESP_PHY_MAX_TX_POWER=20
# default:
# CONFIG_ESP_PHY_REDUCE_TX_POWER is not set
# default:
CONFIG_ESP_PHY_ENABLE_USB=y
# default:
# CONFIG_ESP_PHY_ENABLE_CERT_TEST is not set
# default:
CONFIG_ESP_PHY_RF_CAL_PARTIAL=y
# default:
# CONFIG_ESP_PHY_RF_CAL_NONE is not set
# default:
# CONFIG_ESP_PHY_RF_CAL_FULL is not set
# default:
CONFIG_ESP_PHY_CALIBRATION_MODE=0
# default:
CONFIG_ESP_PHY_PLL_TRACK_PERIOD_MS=1000
# default:
# CONFIG_ESP_PHY_PLL_TRACK_DEBUG is not set
# default:
# CONFIG_ESP_PHY_RECORD_USED_TIME is not set
# default:
CONFIG_ESP_PHY_IRAM_OPT=y
# default:
# CONFIG_ESP_PHY_DEBUG is not set
# default:
CONFIG_ESP_PHY_ENABLE_VERSION_PRINT=y
# end of PHY

#
# Power Management
#
# default:
# CONFIG_PM_SLEEP_FUNC_IN_IRAM is not set
# default:
# CONFIG_PM_ENABLE is not set
# default:
# CONFIG_PM_SLP_IRAM_OPT is not set
# default:
CONFIG_PM_POWER_DOWN_CPU_IN_LIGHT_SLEEP=y
# default:
CONFIG_PM_ESP_SLEEP_POWER_DOWN_CPU=y
# end of Power Management

#
# ESP PSRAM
#

#
# ESP Ringbuf
#
# default:
# CONFIG_RINGBUF_IN_IRAM is not set
# default:
# CONFIG_RINGBUF_PLACE_ISR_FUNCTIONS_INTO_FLASH is not set
# end of ESP Ringbuf

#
# ESP-ROM
#
# default:
CONFIG_ESP_ROM_PRINT_IN_IRAM=y
# end of ESP-ROM

#
# ESP Security Specific
#
# end of ESP Security Specific

#
# ESP-STDIO
#
# default:
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
# default:
# CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG is not set
# default:
# CONFIG_ESP_CONSOLE_UART_CUSTOM is not set
# default:
# CONFIG_ESP_CONSOLE_NONE is not set
# default:
# CONFIG_ESP_CONSOLE_SECONDARY_NONE is not set
# default:
CONFIG_ESP_CONSOLE_SECONDARY_USB_SERIAL_JTAG=y
# default:
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG_ENABLED=y
# default:
CONFIG_ESP_CONSOLE_UART=y
# default:
CONFIG_ESP_CONSOLE_UART_NUM=0
# default:
CONFIG_ESP_CONSOLE_ROM_SERIAL_PORT_NUM=0
# default:
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200
# end of ESP-STDIO

#
# ESP System Settings
#
# default:
# CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_80 is not set
# default:
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_160=y
# default:
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=160
# default:
CONFIG_ESP_SYSTEM_IN_IRAM=y
# default:
# CONFIG_ESP_SYSTEM_PANIC_PRINT_HALT is not set
# default:
CONFIG_ESP_SYSTEM_PANIC_PRINT_REBOOT=y
# default:
# CONFIG_ESP_SYSTEM_PANIC_SILENT_REBOOT is not set
# default:
# CONFIG_ESP_SYSTEM_PANIC_GDBSTUB is not set
# default:
CONFIG_ESP_SYSTEM_PANIC_REBOOT_DELAY_SECONDS=0
# default:
CONFIG_ESP_SYSTEM_SINGLE_CORE_MODE=y
# default:
CONFIG_ESP_SYSTEM_RTC_FAST_MEM_AS_HEAP_DEPCHECK=y
# default:
CONFIG_ESP_SYSTEM_ALLOW_RTC_FAST_MEM_AS_HEAP=y
# default:
CONFIG_ESP_SYSTEM_NO_BACKTRACE=y
# default:
# CONFIG_ESP_SYSTEM_USE_EH_FRAME is not set
# default:
# CONFIG_ESP_SYSTEM_USE_FRAME_POINTER is not set
# default:
CONFIG_ESP_SYSTEM_MEMPROT=y
# default:
CONFIG_ESP_SYSTEM_MEMPROT_PMS=y
# default:
CONFIG_ESP_SYSTEM_MEMPROT_PMS_LOCK=y
# default:
CONFIG_ESP_SYSTEM_EVENT_QUEUE_SIZE=32
# default:
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=2304
# default:
CONFIG_ESP_MAIN_TASK_STACK_SIZE=3584
# default:
CONFIG_ESP_MAIN_TASK_AFFINITY_CPU0=y
# default:
# CONFIG_ESP_MAIN_TASK_AFFINITY_NO_AFFINITY is not set
# default:
CONFIG_ESP_MAIN_TASK_AFFINITY=0x0
# default:
CONFIG_ESP_MINIMAL_SHARED_STACK_SIZE=2048
# default:
CONFIG_ESP_INT_WDT=y
# default:
CONFIG_ESP_INT_WDT_TIMEOUT_MS=300
# default:
CONFIG_ESP_TASK_WDT_EN=y
# default:
CONFIG_ESP_TASK_WDT_INIT=y
# default:
# CONFIG_ESP_TASK_WDT_PANIC is not set
# default:
CONFIG_ESP_TASK_WDT_TIMEOUT_S=5
# default:
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=y
# default:
# CONFIG_ESP_PANIC_HANDLER_IRAM is not set
# default:
# CONFIG_ESP_DEBUG_STUBS_ENABLE is not set
# default:
CONFIG_ESP_DEBUG_OCDAWARE=y
# default:
CONFIG_ESP_SYSTEM_CHECK_INT_LEVEL_4=y
# default:
CONFIG_ESP_SYSTEM_HW_STACK_GUARD=y
# default:
CONFIG_ESP_SYSTEM_HW_PC_RECORD=y
# end of ESP System Settings

#
# IPC (Inter-Processor Call)
#
# default:
CONFIG_ESP_IPC_TASK_STACK_SIZE=1024
# end of IPC (Inter-Processor Call)

